[
    {
        "job_title": "Data Entry Clerk - Remote",
        "job_type": "Entry level Full-time",
        "company_name": "eStaffing Inc.",
        "job_location": "Bangladesh",
        "job_date": "1 month ago",
        "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3590727153",
        "job_description": "Job Tittle- Data Entry Clerk -Remote\n\nJob location- Remote\n\nSalary Depending on Candidate Experience\n\nOpening Required 10 Data entry operator.\n\nFresher can also apply.\n\nEnter data into system accurately and efficiently Organize and maintain files and records Perform other duties as assigned by the supervisor.\n\nCompiling, verifying the accuracy, and sorting information to prepare source data for computer entry.\n\nReviewing data for deficiencies or errors, correcting any incompatibilities, and checking output.\n\nRequired Candidate profile.\n\nGOOD KNOWLEDGE OF COMPUTER MUST HAVE LAPTOP OR SYSTEM MUST HAVE BASIC TYPING SPEED MUST HAVE TYPING ACCURACY NO WORK PRESSURE & NO TIME BOUNDATION"
    },
    {
        "job_title": "Customer Service Specialist- Remote (15 Openings)",
        "job_type": "Entry level Full-time",
        "company_name": "eStaffing Inc.",
        "job_location": "Bangladesh",
        "job_date": "2 months ago",
        "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3536054805",
        "job_description": "Job Tittle- Customer Service Specialist- Remote (15 Openings)\n\nLocation Remote (Anywhere)\n\nWe are seeking a Customer Service Specialist to interact with our customers to provide and process information in response to inquiries and requests about products, services and promotions.\n\nMain Job Tasks and Responsibilities (includes, but is not limited to):\n\nWork with customers daily via email, live chat or other channels\n\nHandle retail customer service inquiries mainly for English-speaking markets.\n\nResponse to minimum 100 E-mails/Live Chat equivalent per day.\n\nPromote our products to customers\n\nThe Successful Applicant\n\nFluency in verbal and written English; additional language is an advantage\n\nExcellent time management and documentation skills\n\nCustomer Service Experience Preferred\n\nAvailability for 30 - 40 hours a week with flexible shifts\n\nHigh-speed stable internet connection\n\nRequired.\n\nGOOD KNOWLEDGE OF COMPUTER MUST HAVE LAPTOP OR SYSTEM MUST HAVE BASIC TYPING SPEED MUST HAVE TYPING ACCURACY NO WORK PRESSURE & NO TIME BOUNDATION"
    },
    {
        "job_title": "HR Generalist - Remote",
        "job_type": "Mid-Senior level Full-time",
        "company_name": "eStaffing Inc.",
        "job_location": "Bangladesh",
        "job_date": "1 month ago",
        "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3542189031",
        "job_description": "Job Tittle- HR Generalist Remote\n\nJob Location Remote\n\nSalary- Depending on Experience\n\nRoles & Responsibilities\nPreparing and sending out offer letters.\nWriting and or developing policies and procedures.\nEnsuing that employees know the policies and procedures and have read them when joining the organization.\nRecruitment creating adverts, dealing with recruitment responses, contacting applicants, arranging interviews, conducting interviews, offer letters.\nCreating and maintaining healthy pool of consulting vendors to source candidates.\nIncharge of content for corporate communications and employee engagement.\nUpdating and handing out contracts of employment\nTaking up references\nEnsuring that you have the correct documentation for all employees.\nCross over with Health and Safety, ensuring it is implemented throughout the business\nDealing with resignations and Exit interviews\nLetters for promotions or changes to roles for all employees\nInductions taking new employees through the induction procedure and ensuring that they know how the business operates and what they need to know\nAnnual reviews for all staff in conjunction with their Managers\nUpdating personnel records for new address, salary changes etc"
    },
    {
        "job_title": "Human Resource associate - Remote",
        "job_type": "Entry level Full-time",
        "company_name": "eStaffing Inc.",
        "job_location": "Bangladesh",
        "job_date": "1 month ago",
        "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3543333482",
        "job_description": "Job Tittle- Human Resource associate - Remote\n\nJob Location Remote\n\nSalary- Depending on Experience\n\nRoles & Responsibilities\nPreparing and sending out offer letters.\nWriting and or developing policies and procedures.\nEnsuing that employees know the policies and procedures and have read them when joining the organization.\nRecruitment creating adverts, dealing with recruitment responses, contacting applicants, arranging interviews, conducting interviews, offer letters.\nCreating and maintaining healthy pool of consulting vendors to source candidates.\nIncharge of content for corporate communications and employee engagement.\nUpdating and handing out contracts of employment\nTaking up references\nEnsuring that you have the correct documentation for all employees.\nCross over with Health and Safety, ensuring it is implemented throughout the business\nDealing with resignations and Exit interviews\nLetters for promotions or changes to roles for all employees\nInductions taking new employees through the induction procedure and ensuring that they know how the business operates and what they need to know\nAnnual reviews for all staff in conjunction with their Managers\nUpdating personnel records for new address, salary changes etc"
    },
    {
        "job_title": "Office Assistant",
        "job_type": "Entry level Full-time",
        "company_name": "IFC - International Finance Corporation",
        "job_location": "Dhaka, Dhaka, Bangladesh",
        "job_date": "2 days ago",
        "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3610826674",
        "job_description": "IFC—a member of the World Bank Group—is the largest global development institution focused on the private sector in emerging markets. We work in more than 100 countries, using our capital, expertise, and influence to create markets and opportunities in developing countries. In fiscal year 2022, IFC committed a record $32.8 billion to private companies and financial institutions in developing countries, leveraging the power of the private sector to end extreme poverty and boost shared prosperity as economies grapple with the impacts of global compounding crises. For more information, visit www.ifc.org.\n\nThe South Asia Department is recruiting a Office Assistant to be based at Dhaka, Bangladesh.\n\nRoles And Responsibilities\nAssist with visiting missions to ensure their travel update.\nAssist Office Administrator for the IFC Dhaka office in transportation, and office facilities which include Cafeteria, other common services, and other day-to-day required requirements.\nAssist in managing petty cash.\nProvides Airport Protocol service at the Dhaka Airport (Hazrat Shahjalal International Airport) to IFC High Officials Visiting Bangladesh by arranging personalized Meet & Greet or Protocol Services to facilitate our passages.\nAssist in managing International Staff and visitors’ valid visas, work permits, customs, and tax papers.\nProvide logistics support for workshops, meetings, and conferences including organizing venues, transportation, and accommodation.\nProvide support to update data related to vehicle use such as maintenance records, driver over-time, and fuel consumption.\nAssist in the collection and dispatch of IFC mail, including customs clearance for imported goods.\nProvide support for maintaining the office filing system and staff data update.\nProvide administrative support as per requirement time-to-time.\n\nSelection Criteria\nHigh School degree required; College degree preferred; with 2-3 years of relevant experience.\nExcellent interpersonal and communication skills and the ability to interact effectively with clients and staff at all levels.\nProficiency in using advanced functions of computer applications such as Microsoft Office (Word, Outlook, Excel, PowerPoint.\nAbility to draft and translate simple correspondence as required.\nPrior experience in a similar office assistant role; experience in a client service function in a multi-lingual environment would be a plus.\nA proven team player, deeply committed to working unselfishly and highly collaboratively as part of a multi-disciplinary team to contribute productively to the team's work and output; demonstrating respect for different points of view; always acting with integrity to build trust with team members and external clients and partners.\nFluent in English\nFollows guidance from Senior EA promptly and proactively; and\nWorks with exemplary dedication to our clients above.\n\nWorld Bank Group Core Competencies\n\nThe World Bank Group offers comprehensive benefits, including a retirement plan; medical, life and disability insurance; and paid leave, including parental leave, as well as reasonable accommodations for individuals with disabilities.\n\nWe are proud to be an equal opportunity and inclusive employer with a dedicated and committed workforce, and do not discriminate based on gender, gender identity, religion, race, ethnicity, sexual orientation, or disability.\n\nLearn more about working at the World Bank and IFC, including our values and inspiring stories."
    }
]