[
  {
    "job_title": "Customer Service Specialist- Remote (15 Openings)",
    "job_types": "Entry level Full-time",
    "company_name": "eStaffing Inc.",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3536054805",
    "job_description": "Job Tittle- Customer Service Specialist- Remote (15 Openings)\n\nLocation Remote (Anywhere)\n\nWe are seeking a Customer Service Specialist to interact with our customers to provide and process information in response to inquiries and requests about products, services and promotions.\n\nMain Job Tasks and Responsibilities (includes, but is not limited to):\n\nWork with customers daily via email, live chat or other channels\n\nHandle retail customer service inquiries mainly for English-speaking markets.\n\nResponse to minimum 100 E-mails/Live Chat equivalent per day.\n\nPromote our products to customers\n\nThe Successful Applicant\n\nFluency in verbal and written English; additional language is an advantage\n\nExcellent time management and documentation skills\n\nCustomer Service Experience Preferred\n\nAvailability for 30 - 40 hours a week with flexible shifts\n\nHigh-speed stable internet connection\n\nRequired.\n\nGOOD KNOWLEDGE OF COMPUTER MUST HAVE LAPTOP OR SYSTEM MUST HAVE BASIC TYPING SPEED MUST HAVE TYPING ACCURACY NO WORK PRESSURE & NO TIME BOUNDATION"
  },
  {
    "job_title": "HR Generalist - Remote",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "eStaffing Inc.",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3542189031",
    "job_description": "Job Tittle- HR Generalist Remote\n\nJob Location Remote\n\nSalary- Depending on Experience\n\nRoles & Responsibilities\nPreparing and sending out offer letters.\nWriting and or developing policies and procedures.\nEnsuing that employees know the policies and procedures and have read them when joining the organization.\nRecruitment creating adverts, dealing with recruitment responses, contacting applicants, arranging interviews, conducting interviews, offer letters.\nCreating and maintaining healthy pool of consulting vendors to source candidates.\nIncharge of content for corporate communications and employee engagement.\nUpdating and handing out contracts of employment\nTaking up references\nEnsuring that you have the correct documentation for all employees.\nCross over with Health and Safety, ensuring it is implemented throughout the business\nDealing with resignations and Exit interviews\nLetters for promotions or changes to roles for all employees\nInductions taking new employees through the induction procedure and ensuring that they know how the business operates and what they need to know\nAnnual reviews for all staff in conjunction with their Managers\nUpdating personnel records for new address, salary changes etc"
  },
  {
    "job_title": "Human Resource associate - Remote",
    "job_types": "Entry level Full-time",
    "company_name": "eStaffing Inc.",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3543333482",
    "job_description": "Job Tittle- Human Resource associate - Remote\n\nJob Location Remote\n\nSalary- Depending on Experience\n\nRoles & Responsibilities\nPreparing and sending out offer letters.\nWriting and or developing policies and procedures.\nEnsuing that employees know the policies and procedures and have read them when joining the organization.\nRecruitment creating adverts, dealing with recruitment responses, contacting applicants, arranging interviews, conducting interviews, offer letters.\nCreating and maintaining healthy pool of consulting vendors to source candidates.\nIncharge of content for corporate communications and employee engagement.\nUpdating and handing out contracts of employment\nTaking up references\nEnsuring that you have the correct documentation for all employees.\nCross over with Health and Safety, ensuring it is implemented throughout the business\nDealing with resignations and Exit interviews\nLetters for promotions or changes to roles for all employees\nInductions taking new employees through the induction procedure and ensuring that they know how the business operates and what they need to know\nAnnual reviews for all staff in conjunction with their Managers\nUpdating personnel records for new address, salary changes etc"
  },
  {
    "job_title": "Business Analyst",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Quantanite",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "3 weeks ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3599115292",
    "job_description": "Company Description\n\nQuantanite is a business process outsourcing (BPO) and customer experience (CX) solutions company that helps fast-growing companies and leading global brands to transform and grow. We do this through a collaborative and consultative approach, rethinking business processes and ensuring our clients employ the optimal mix of automation and human intelligence. We’re an ambitious team of professionals spread across four continents and looking to disrupt our industry by delivering seamless customer experiences for our clients, backed-up with exceptional results. We have big dreams, and are constantly looking for new colleagues to join us who share our values, passion and appreciation for diversity.\n\nJob Description\n\nWork to help the organization's efficiency and profitability by analyzing its business processes, identifying areas for improvement, and developing strategies to address those areas.\nDefine the performance objectives that the system or process needs to achieve. This includes identifying the performance metrics that will be used to measure success, such as response time, throughput, or accuracy.\nGather data on the current performance of the system or process. This may include data from existing systems, user feedback, or other sources.\nAnalyzing data to identify areas where performance is below the desired level. This may involve identifying bottlenecks, analyzing system logs, or using statistical analysis techniques.\nBased on the analysis, identify requirements that are necessary to achieve the desired level of performance. This may include changes to business processes and or systems.\nPrioritizing requirements based on their impact on performance, cost, and feasibility.\nDocumenting performance requirements in formal documents, such as a requirements specification and establishing reporting.\nWork with the stakeholders to develop solutions that address identified problems or opportunities. These solutions may include changes to business processes, technologies, or organizational structure.\nFacilitating communication between different departments or stakeholders, helping to facilitate communication and ensure that everyone is on the same page.\nManaging projects related to process improvement, technology implementation, or other initiatives.\nMonitoring and evaluating the performance of implemented solutions to ensure that they are achieving the desired results.\nCreate reports, dashboards, and visualizations to understand business performance.\nQualifications\n\nPreferably qualified Business Graduate from a reputed University/Institute\nProfessional Certification: Six Sigma, Certified Business Analysis Professional (CBAP)\nSkills Required: Business Analysis, Effective communication and interpersonal skills, Organization Development Process Improvement, Problem Solving Skills, Project Management, Project Planning\n\nAdditional Information\n\nBenefits\n\nIn addition to your compensation, our perks include:\n\nDress: You can wear casual dress in the office.\nEmployee Engagement: Experience our family community and embrace our culture where we bring people together to laugh and celebrate our achievements.\nProfessional development: We love giving back and ensure you have opportunities to grow with us and even travel on occasion.\nEvents: Regular team and organization-wide get-togethers and events.\nAnnual leave payments and festival bonuses\n\nFuture development\n\nAt Quantanite, you’ll have a personal development plan to help you improve in the areas you’re looking to develop in over the coming years. Your manager will dedicate time and resources to supporting you in getting you to the next level.\n\nYou’ll also have the opportunity to progress internally. As a fast-growing organization, our teams are growing, and you’ll have the chance to take on more responsibility over time. So, if you’re looking for a career full of purpose and potential, we’d love to hear from you!"
  },
  {
    "job_title": "Senior Executive - LM Operations",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Xpressbees (BusyBees Logistics Solutions Pvt. Ltd.)",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3581720250",
    "job_description": "Exp: 4-7 years; Job descriptions Department B2C Xpress Operations Role Description The Operations Executive role includes the following tasks Communicating with upper management to develop strategic operations goals. Developing strategic long-range plans to achieve strategic objectives. Creating and managing the organization's fiscal operating and capital budget and expenses. Duties/Responsibilities Responsible for last mile operations of multiple DC/branches. Responsible to arrange maximum deliveries within TAT. Also, decreasing aging of the shipments. Ensures quality check of all shipments/bags and ensure zero missing shipments with value and count. Preparation of various MIS reports like Inbound, outbound, RTO and aging reports. Monitor the NDR/RTO and finding solutions for reducing monthly NDR & RTO percentage. Need to minimize the TAT failure and plan strategies accordingly. Construct Strategy to improve the operations scorecard. Evaluate and reduce operations cost. Monitoring and auditing of daily, weekly & monthly performance reports to ensure smooth execution of operations. Collect, track, & present metrics related to processes, team accuracy and efficiency, and drive improvements in efficiency, throughput and cost across the organization. Tracking & maintaining data for daily shipments. Required Skills/Abilities Good Excel knowledge & Data management. English and Regional Language fluency is Must. 4 Years Experience. Manpower management. Geographical Knowledge. Education Qualifications Graduate / Post-Graduate"
  },
  {
    "job_title": "Frankfinn Aviation - Telesales Role",
    "job_types": "Entry level Full-time",
    "company_name": "Frankfinn Aviation Services Pvt. Limited",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3588702082",
    "job_description": "Make outgoing calls to students to brief them about Frankfinn courses and based on their interest, ask them to attend free career counselling sessions in Frankfinn institute.\nFollow up with the students in a timely manner to know the status of their visit.\nMaintain regular attendance and to arrive to work on time.\n\n(ref:updazz.com)"
  },
  {
    "job_title": "Customer Support",
    "job_types": "Entry level Full-time",
    "company_name": "Strikingly",
    "job_location": "Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3597011420",
    "job_description": "We are Strikingly\n\nStrikingly is a modern, mobile-optimized website builder that’s extremely easy to use. Our mission is to give everyone the power to unleash their individuality.\n\nOur headquarters is currently based in Shanghai, China but we have deep Silicon Valley roots. We’re backed by Y Combinator (W13), SV Angel, Funders Club, Innovation Works, Infinity Ventures, Index Ventures, Kevin Hale, and many others.\n\nThe Role\n\nYour Responsibilities Will Include\n\nDeveloping and executing CSR programs as well as conducting periodic program reviews to assess outcomes and effectiveness.\nActing as the focal point for the Company's CSR initiatives in the geography and building relationships with community partners and key stakeholders.\nStaying abreast of relevant research, trends in the areas of focus and promoting best practices.\nPromoting employee volunteering initiatives in coordination with internal stakeholders.\nDriving budget & monitoring spend to deliver results in line with planned objectives.\nManaging corporate communications across internal channels/platforms.\nDeveloping messaging and content for corporate communications.\nKeeping staff updated and engaged on corporate developments and strategies through various internal communication channels/platforms.\n\nIdeal Profile\n\nSkills Required\n\nYou have at least 1 year experience ideally in CSR within IT industry.\nExperience within Internal Communications, would be a strong advantage.\nYou have good knowledge of Other.\nYou are a strong networker & relationship builder\nYou pay strong attention to detail and deliver work that is of a high standard\nYou are a self-starter and demonstrate a high level of resilience\nFluent in Italian and English in order to be able to effectively liaise with stakeholders in the region.\n\nWhat's on Offer?\n\nOpportunity within a company with a solid track record of performance\nStrong opportunities to progress your career\nWork alongside & learn from best in class talent"
  },
  {
    "job_title": "Customer Service Representative- Remote",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "eStaffing Inc.",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3549566800",
    "job_description": "Job Tittle- Customer Service Representative- Remote\n\nLocation Remote (Anywhere)\n\nWe are seeking a Customer Service Specialist to interact with our customers to provide and process information in response to inquiries and requests about products, services and promotions.\n\nMain Job Tasks and Responsibilities (includes, but is not limited to):\n\nWork with customers daily via email, live chat or other channels\n\nHandle retail customer service inquiries mainly for English-speaking markets.\n\nResponse to minimum 100 E-mails/Live Chat equivalent per day.\n\nPromote our products to customers\n\nThe Successful Applicant\n\nFluency in verbal and written English; additional language is an advantage\n\nExcellent time management and documentation skills\n\nCustomer Service Experience Preferred\n\nAvailability for 30 - 40 hours a week with flexible shifts\n\nHigh-speed stable internet connection\n\nRequired.\n\nGOOD KNOWLEDGE OF COMPUTER MUST HAVE LAPTOP OR SYSTEM MUST HAVE BASIC TYPING SPEED MUST HAVE TYPING ACCURACY NO WORK PRESSURE & NO TIME BOUNDATION"
  },
  {
    "job_title": "Business Strategist",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Sheba.xyz",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "1 week ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3593533576",
    "job_description": "Company Description\n\nSheba Platform Limited designs technological solutions to make urban life easier while addressing the major pain points of small businesses.\n\nOur first product sheba.xyz is the country’s largest online service marketplace. sBusiness on the other hand is serving emerging\n\ncorporates and sManager is providing full-stack financial solutions for SMEs and digitizing all flows of their business.\n\nJob Description\n\nDevelop growth strategies and plans, by identifying and mapping business strengths and customer needs.\nManage and nurture relationships with existing customers.\nTrack and report on the status of proposal components\nWork with the pricing department to create rate proposals\nNegotiate, draft and review contracts.\nDevelop and maintain client relationships\nCoordinate with sales teams to develop mutually beneficial proposals\nNegotiate contract terms with clients and communicate with stakeholders\nMonitor project teams to ensure contracts are executed as agreed\nGather useful information from customer and competitor data\nMake and give presentations to prospective clients and internal executives\nCreate and implement processes and policies to support the overall business\nQualifications\n\nBachelor's degree in Business Administration, Economics, Statistics\n3+ years of experience as a Business Strategist or related role\nStrong analytical skills and attention to detail\nExcellent communication skills, including the ability to communicate complex concepts to both technical and non-technical stakeholders\nStrong value management skills and the ability to work effectively in a team environment\nProficiency in Microsoft Office, including Excel, PowerPoint, and G-suit\nRequires the excellent analytical ability and strong judgment and decision-making abilities\n\nAdditional Information\n\nSalary: Good salary packages for highly deserving candidates\nEmployee Benefits Packages as per the company policy\nWeekly 2 holidays\nLunch Facilities: Subsidized\nSalary Review: Yearly\nFestival Bonus: 2"
  },
  {
    "job_title": "Doctors (Video Consultations)",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Medisense Healthcare",
    "job_location": "Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3597009515",
    "job_description": "Medisense is a unique global health and wellness platform, allowing patients to connect with healthcare professionals from across the globe. It is a multilingual, video-first consultation platform where doctors can video consult globally, without limitations.\n\nWe are currently seeking highly skilled and experienced physicians to join our global online video consultation platform. Our mobile-first platform allows patients from all over the world to easily connect with doctors from Sri Lanka, Pakistan, Nepal, India, Egypt, Jordan, Lebanon, Philippines, and Bangladesh providing an additional revenue stream for our medical professionals.\n\nAs a member of our team, you will have the opportunity to consult with patients from Qatar (for now), expand your patient base and gain international medical experience.\n\nThe Role\n\nYour Responsibilities Will Include\n\nTo provide online video consultations to users from Qatar remotely.\nYou can help with diagnosis, treatment, and management of medical conditions, and can also provide guidance on follow-up care.\nOpportunity to consult with patients from Qatar (for now)\n\nIdeal Profile\n\nSkills Required\n\nMust be a licensed physician in Bangladesh in order to be able to cover our business requirements in this market.\nComfortable consulting in local languages in order to be able to effectively liaise with stakeholders in the region.\nStrong communication and interpersonal skills.\nProficient in using digital platforms and technology.\nAbility to work independently and manage your own schedule.\n\nWhat's on Offer?\n\nOverseas video consultation\nAttractive Salary & Benefits\nFlexible working options"
  },
  {
    "job_title": "Area Manager - Marketing",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Astral Pipes",
    "job_location": "Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3584683284",
    "job_description": "Job Details\nDrive a culture of performance amongst L1s – assign responsibilities,review and manage performance, guide and counsel and provide feedback on performance so as to ensure a motivated and committed team\nVisit Priority Customers/ Prefered dealer/ distributors.\nPromote products and enable movement of stocks from distributors to stockists, stockists to retailers, and retailers to end users\nUnderstand problems and take action steps to resolve the same\nDrive promotional schemes and ensure the benefits of the schemes are shared fairly by the stakeholders\nShare promotional materials\nGather information about the schemes prevalent in the market / new schemes rolled-out by peers\nGather information about new products\nGather information related to product sales – product-wise, SKU-wise\nCoordinate with the branding team for exhibiting Astral branding through shop bill-boards, shop displays, etc.\nCoordinate with the retailers and L1 - Marketing for effective exhibition of Astral branding in their shops; understand their concerns and resolve the same\nCoordinate with Astral’s technical team in cases of quality issues / product defects.\nMap the market to identify more retailers; improve the retailer network"
  },
  {
    "job_title": "Head of Marketing",
    "job_types": "Director Full-time",
    "company_name": "foodpanda",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "3 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3598641021",
    "job_description": "About Foodpanda\n\nfoodpanda is dedicated to bringing food lovers around the world their favorite meals from curated local restaurants. Since its creation, the on-demand food delivery service has grown to more than 100,000 partner restaurants in more than 325 cities across 13 Asian and Central European countries globally. foodpanda is active in Bangladesh, Cambodia, Hong Kong, Laos, Malaysia, Myanmar, Pakistan, Philippines, Singapore, Taiwan, Thailand, Romania, and Bulgaria. It belongs to Delivery Hero, a worldwide leader in the food delivery industry. For more information visit www.foodpanda.com.bd\n\nAbout Delivery Hero\n\nDelivery Hero is a leading global online food ordering and delivery marketplace with number one market positions in terms of restaurants, active users, and orders in more countries than any of its competitors across over 70 countries in Europe, the Middle East & North Africa (MENA), Latin America and the Asia-Pacific region. Delivery Hero also operates its own delivery service in high-density urban areas worldwide. The Company is headquartered in Berlin and has over 21,000 employees. For more information, please visit www.deliveryhero.com. We are currently expanding rapidly in APAC, where we currently operate in 14 countries, and are always on the hunt for the brightest minds to join our team.\n\nAbout The Role\n\nWe are looking to hire a Head of Marketing, to manage the marketing efforts of the organization in Bangladesh and be part of a team with highly talented and motivated marketers. The role will lead our diverse and smart marketing team and will be responsible for all marketing and growth metrics. The incumbent will define and spearhead company-wide growth strategies together with the local team and regional team.\n\nBe part of a diverse team driving the growth of the number one food delivery service in APAC with visibility in Europe, MENA, and South America. Learn and grow with the best, and get the rare opportunity to build a brand that everyone loves, in one of the most exciting and fastest-growing regions in the world.\n\nResponsibilities:\nCraft strategies for the marketing team, including Digital, Advertising, Communications, and Creatives.\nPlan and manage monthly, quarterly, and annual brand and online budgets for the Marketing team\nMonitor, and analyze all marketing performance KPI and how they attribute in terms of Orders and Brand Health.\nIdentify opportunities to reach new market segments to drive acquisitions and expand market share.\nWork with the Commercial team to develop pricing strategies to maximize efficiency and market share.\nCollaborate with the Regional Marketing team and external partners toward achieving business objectives.\nContinuously optimize platform comms and media channels, and roll out radical marketing campaign ideas, be it CRM, digital, social, offline, and through partnerships/ collaborations\nBe involved in creating a localized, thematic local Social Media content marketing and initiating content marketing campaigns to reach targets.\nSpearheading seasonal or annual 360 marketing campaigns.\n\nRequirements:\nSeasoned marketer: marketing and growth responsibility in consumer startup OR with at least 8-10 years' experience in growing a brand/business, preferably in the e-commerce and/or FMCG industry.\nBachelor's degree in marketing/Business or any related field.\nFamiliar both with brand metrics (reach, frequency, TOM etc) and performance marketing metrics (CTR, CPA, CPO, ROMI etc)\nHighly analytical & number-driven: cohorts, attribution, CAC, etc are what you think about day and night. \"If you can't measure it (or find a proxy), it didn't happen\" is your\nmotto Inspiring leader: proven track record of managing and building teams.\nAlchemist: you constantly run growth experiments in a highly structured and organized way\nPassionate about brands: metrics driven with a deep understanding of branding\nProduct marketing expertise in the web technology sector and the ability to contribute at strategic, operational, and tactical levels\nHas excellent organizational and stakeholder management skills. Has the ability to set priorities, problem-solve, multi-task, and work well independently in a dynamic, rapidly changing workplace\nCreativity and innovation, ability to think out of the box and conceptualize creative campaigns that can drive positive brand awareness.\nExperience in managing P&L responsibility in a fast-paced e-commerce environment\n\nWhat Can You Expect\nA dynamic and rewarding working environment.\nResponsibility from day one in a fast-growing and global company.\nA vibrant and international team with diverse backgrounds."
  },
  {
    "job_title": "Senior Executive/ Executive, Finance",
    "job_types": "Executive Full-time",
    "company_name": "Sheba.xyz",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3593537504",
    "job_description": "Company Description\n\nsheba.xyz is Bangladesh’s first and biggest online service marketplace with 15,000+ service providers catering to the needs of 100K+ families. We started in 2016 and gradually grew to 241+ services being offered on our platform. Be it cleaning, plumbing, electronic repair, chauffeur services, car rental, air-con, home and office shifting or at-home salon services, Sheba.xyz is connecting the growing number of urban households to professional providers at the click of a button. We provide training, certification, business management assistance, and quality assurance to keep generating demand for our service providers. We also have dedicated teams who work relentlessly to ensure high customer satisfaction, keeping this at the center of our focus.\n\nJob Description\n\nAssist monthly, quarterly, and annual financial statements along with quarterly financial performance for board presentation and reporting to supervisor\nForecasting cash payments and anticipating challenges arising from limited cash flow\nTo assist in the management of all accounting procedures and systems used by the organization\nResponsible for all financial transactions and payment functions\nPrepare and maintain asset register with a depreciation schedule\nEnsure timely VAT & TAX return submission\nVendor payment in due time with proper VAT & TAX deduction\nManaging daily operations & other ad hoc requirements\nResponsible for system vs bank reconciliation within the deadline.\nCollaborate with cross-functional stakeholders to gather & assess Financial and non-financial information\nEnsure daily all customer refund\nResponsible for all ledger reconciliation before monthly reporting\n\nQualifications\n\nEducational Qualifications\n\nBachelor of Business Administration (BBA) in Finance/ Accounts\nSound knowledge of financial compliances\nProficient in financial & accounting software and tools\nSkills Required: account pay, Corporate Finance, Financial & Management Reporting, VAT and Tax, Vendor payment\n\nExperience Qualifications\n\n3 to 4 years (s) of working experience in the similar field\nWorking experience in a similar industry will be an added advantage\nWorking with tools MS Excel, IFRS, IAS , Tally ERP or equivalent skills set is required is required\n\nSkills Set\n\nStrong numerical aptitude and attention to detail\nShall possess \"can do attitude\"\nStrong decision-making ability\nStrong communication & interpersonal skills\nHave experience in internal & external Audit Dealing\n\nAdditional Information\n\nSalary: Good salary packages for highly deserving candidates\nEmployee Benefits Packages as per the company policy\nWeekly 2 holidays\nLunch Facilities: Subsidized\nSalary Review: Yearly\nFestival Bonus: 2"
  },
  {
    "job_title": "Customer Services Officer",
    "job_types": "Not Applicable Full-time",
    "company_name": "British Council",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "2 weeks ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3581334954",
    "job_description": "We support peace and prosperity by building connections, understanding and trust between people in the UK and countries worldwide.\n\nWe work directly with individuals to help them gain the skills, confidence and connections to transform their lives and shape a better world in partnership with the UK. We support them to build networks and explore creative ideas, to learn English, to get a high-quality education and to gain internationally recognised qualifications.\n\nWorking with people in over 200 countries and territories, we are on the ground in more than 100 countries. In 2021–22 we reached 650 million people.\n\nCustomer Services Officer\n\nRole Purpose\n\nTo provide enquiry and registration services for full range of British Council offers in a manner that he/ she achieves income and conversion targets. To work closely with business teams and aim to resolve customer enquiries in first contact. The post will play a key role in providing an engaging and friendly customer experience at our physical centres and on social media platforms and Web chat. Operate within clear guidelines, defined procedures and quality standards and is subject to close supervision.\n\nThe post holder collects and records information regarding enquiries as per the prescribed procedures and guidelines. The role is responsible for driving income and does so by converting enquiries into registrations, upselling and crossselling\n\nMain Accountabilities But Not Limited To The Following\n\nCustomer Experience and Sales\n\nWelcome all customers and visitor in a friendly and professional manner, Answer, All first level enquiries received in person, by email, through call centre, social media and web in a friendly and professional manner\nThe quality of customer interaction is proactive, customer friendly and compliant to British Council brand guidelines and Customer Service standards.\nProvide accurate information, promotional & registration material on all services offered by the British Council. Guide customers on the registration process and make all reasonable efforts to provide resolution at first contact.\nBuild rapport with the prospect in order to find out the objectives, needs and requirements of the customer, and take their interest forward.\nPromote self-access solutions to customers and facilitate their journey by working flexibly as a floor walker.\nContribute to customer service indicators like CSAT, customer feedback, net promoter score, customer effort assessment scores for the centre.\nAll opportunities are recorded on CRM, databases and records, and information files are kept up to date in line with requirements outlined by Customer Services Manager.\nAll feedback and customer comments are passed on to the shift in charge or line Manager within one working day and recorded in writing.\nUsing the appropriate systems, to register and obtain payments from all customers, while adhering to the procedures in place. Effectively resolve and record customer enquiry, reason for contact and contact details on CRM or appropriate system.\nHandle first level complaints promptly and escalate serious and sensitive complaints in a timely manner\n\nBusiness Delivery\n\nAcquire and maintain an excellent level of product knowledge at all times.\nAs duty officer ensure that designated tasks for the relevant shifts are completed accurately.\nSpecific projects and responsibilities given to each member of staff (eg: product leadership or information management) are carried out in line with objectives.\nFlexibility to rotate between work stations, i.e. Call centre, front of house/front desk, meet and greet, and integrated customer service desk.\nFlexibility to work extra hours during registration period in order to achieve the service level agreements on access and quality.\nRecording income accurately and managing end of day reconciliation\nResponding to more complex enquiries such as refunds and transfer postponements class credits etc in line with process agreed with the business team\n\nSales And Product Promotion\n\nCross sell and upsell British Council services to deepen the customer engagement with the British Council using a ‘’soft sell’’ approach.\nHandling consultations and turning enquiries into sales while achieving the defined conversion targets.\nMake outbound calls when required, to support customers dropping out at different stages of the customer journey.\n\nRisk & Compliance\n\nMaintain and record data in a risk averse manner and capturing customer consent on the required system\nAccurately and promptly mange day end reconciliation - Responsible for balancing physical cash, card payments, cheques & direct bank transfers with the final day end reports.\nFamiliarise on the Customer Service financial guide and ensure this is followed at all times.\n\nRole Specific Knowledge And Experience\n\nMinimum and essential\n\nAt least 2-years of providing customer services (face to face, call centre) and/or sales experience preferably in the fast pacing services industry\nGood written and oral language skills.\nFamiliarity with the departmental procedures, policies, guidelines, and SLAs.\nThorough understanding of marketing and negotiating techniques\nFast learner and passion for customer service and sales\nSelf-motivated with a result- driven approach\n\nDesirable\n\nKnowledge of British Council products and services\nExperience of multi-national or international work environment, education, or hospitality industry\nCustomer Relationship Management System\n\nRole Specific Skills\n\nGood written and oral language skills.\nexcellent skills on a range of standard computer software (e.g., Microsoft Office, email)\nSelf-motivated and target focused\nResilience\nStrong communication skills – including both verbal and written\nThe ability to influence and negotiate with others\nCommercial awareness\nProblem solving\nNumerical skills\n\nFurther Information\n\nVacancy – 4\n\nLocation – Bangladesh (3 in Dhaka, 1 in Chattogram)\n\nPay Band – 4\n\nContract Type – Indefinite contract - Local\n\nRequirements - Candidates must have the pre-existing right to live and work in Bangladesh.\n\nClosing Date – Saturday, 13 May 2023.\n\nA connected and trusted UK in a more connected and trusted world.\n\nEquality , Diversity, and Inclusion (EDI) Statement\n\nThe British Council is committed to policies and practices of equality, diversity and inclusion across everything we do. We support all staff to make sure their behaviour is consistent with this commitment. We want to address under representation and encourage applicants from under-represented groups, in particular, but not exclusively, on grounds of ethnicity and disability. All disabled applicants who meet the essential criteria are guaranteed an interview and we have Disability Confident Employer Status. We welcome discussions about specific requirements or adjustments to enable participation and engagement in our work and activities.\n\nThe British Council is committed to safeguarding children, young people and adults who we work with.\n\nWe believe that all children and adults everywhere in the world deserve to live in safe environments and have the right to be protected from all forms of abuse, maltreatment and exploitation as set out in article 19, UNCRC (United Nations Convention on the Rights of the Child) 1989.\n\nAppointment to positions where there is direct involvement with vulnerable groups will be dependent on thorough checks being completed; these will include qualification checks, reference checks, identity & criminal record checks in line with legal requirements and with the British Council’s Safeguarding policies for Adults and Children.\n\nIf you have any problems with your application please email askhr@britishcouncil.org\n\nPlease note: Applications to this role can only be considered when made through the Apply section of our careers website. Our ‘ASK HR’ email is only to be used in case of a technical issue encountered when applying through the careers website. Emails with supporting statements and CV/Resumes sent to this email address will not be reviewed and will be deleted."
  },
  {
    "job_title": "Virtual Assistant",
    "job_types": "Entry level Full-time",
    "company_name": "Heyo",
    "job_location": "Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3597013266",
    "job_description": "Heyo is a next-gen technology company building the future of professional identity.\n\nWe are an early-stage startup, based in New York, backed by leading VCs, angels, and operators. In just a few months, we’ve worked with hundreds of leading companies and thousands of professionals.\n\nIf you have been in the job search process for a while, you know the pain point we are trying to solve. Our platform and early engagement philosophy enable professionals to build careers on their own terms.\n\nThe Role\n\nWe are seeking a dedicated and organized remote Virtual Assistant to join our team. Your day-to-day responsibilities will be focused on the execution of various administrative tasks and community management. We will provide you with the necessary training, tools, and instructions to complete these tasks.\n\nYour Responsibilities Will Include\n\nResponding to emails and phone calls.\nScheduling meetings.\nBooking travel and accommodations.\nManaging a contact list.\nPreparing customer spreadsheets and keep online records.\nOrganizing managers’ calendars.\nPerforming market research.\nCreating presentations, as assigned.\nAddressing employees administrative queries.\nProviding customer service as first point of contact.\n\nTo be considered, along with your apply, you should tell about yourself via Heyo profile (heyo.at). Candidates without profile won't be contacted.\n\nIdeal Profile\n\nYou are available to work US hours (East Coast preferred)\nYou have fluency in using tech tools (Slack, Notion, LinkedIn, Gmail, etc.)\nYou have advanced English skills to be able to liaise effectively to different stakeholders across the region.\n\nWhat's on Offer?\n\nA role that offers a breadth of learning opportunities\nOpportunities for career growth & development\nFlexible working options"
  },
  {
    "job_title": "Manager/ Senior Manager - Channel Sales (Fintech)",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Sheba.xyz",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3590402828",
    "job_description": "Company Description\n\nSheba Platform Limited plays the role of a catalyst for micro-entrepreneurs and ignites the spark in them to dream bigger. By bringing access to information and financial literacy in the palm of their hands, we are bridging the digital divide and creating access to affordable and timely financial services.\n\nJob Description\n\nDevelop and execute a channel sales strategy that aligns with the company's overall business objectives\nBuild and maintain strong relationships with channel partners, including distributors, and Value Added Marchants.\nCollaborate with internal teams (such as Marketing, Product) to develop and implement channel programs and initiatives that support the overall sales strategy\nManage and monitor the performance of merchants, providing guidance and support as needed to ensure they meet or exceed their sales targets\nAnalyze sales data and metrics to identify trends and opportunities for improvement\nCreate and deliver sales activation program, training programs to merchants to increase their product knowledge and sales effectiveness\nStay up-to-date on industry trends and developments, and adjust the channel sales strategy as needed to remain competitive\nQualifications\n\nBachelor's degree in Business, Sales, Marketing or related field\n7+ years of experience in channel sales, with a proven track record of achieving sales targets\nExcellent communication and interpersonal skills, with the ability to build strong relationships with internal and external stakeholders\nStrong analytical skills, with the ability to use data to inform decisions and measure performance\nAbility to work independently and as part of a team in a fast-paced, dynamic environment\nWillingness to travel as needed to meet with channel partners and attend industry events\nProven track record of successful sales campaigns and experience with developing and managing sales channels in any fintech organization\nKnowledge of financial services regulations and compliance requirements\n\nAdditional Information\n\nSalary: Negotiable (depending on experience, and capabilities)\nKPI based monthly variable salary\nEmployee Benefits Package comprising Sheba’s Services\nMobile Allowance\nPartially subsidized lunch\nIn our own gadget policy, we use our own laptops and get allowances based on the model\nSalary Review: Yearly\nFestival Bonus: 2"
  },
  {
    "job_title": "International Communication Consultant",
    "job_types": "Mid-Senior level Internship",
    "company_name": "UNICEF",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "1 week ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3591662466",
    "job_description": "Background And Purpose Of The Assignment\n\nThe UNICEF Bangladesh Communication Section is supporting several grant-based commitments including immunization for children, UHC, ending child marriage, empowerment of marginalized adolescents, children with disabilities and child protection, contributing significantly to media relations and advocacy. These project-related requirements will be met with the support of an international communication consultant.\n\nWork Assignment Overview\n\nTasks/Milestones Deliverables/Output Timeline\n\nDevelop, write and adapt press releases, statements, key messages, speeches, media lines etc. for World Breast Feeding Week, Rohingya crisis commemoration day, World Water Week, photo exhibition on children living on street. Support proactive and reactive media relations, such as requests for information and interviews. Media monitoring\n\nPress releases, statements, key messages, speeches, op-eds, media lines, media monitoring highlights.\n\nAugust 2023\n\nDevelop, write and editorially support external communication material such as stories, publications, advocacy briefs, campaigns etc. and media monitoring\n\nAt least 4 human interest stories, publications, advocacy briefs, and campaigns, media monitoring highlights.\n\nSeptember 2023\n\nDevelop, write and adapt press releases, statements, key messages, speeches, media lines etc. for Birth Registration Day, International Day of the Girl Child and ending child marriage, adolescent empowerment, Global Handwashing Day Support proactive and reactive media relations, such as requests for information and interviews, media monitoring\n\nPress releases, statements, key messages, speeches, op-eds, media lines, media monitoring highlights.\n\nOctober 2023\n\nOrganize and support Meena Media Award Event. Develop, write and adapt press releases, statements, key messages, speeches, media lines etc. for World Pneumonia Day, World Prematurity Day, UHC, media monitoring\n\nRun of show, documentation, meeting notes, invitation card, list of invitees, email to invitees, press release, media management, media monitoring highlights.\n\nNovember 2023\n\nProduce media content for World Children’s Day and media monitoring\n\nPress release, documentation, meeting notes, support any other activation during World Children’s Day, media monitoring highlights.\n\nDecember 2023\n\nDevelop, write and editorially support internal materials and media monitoring\n\nTORs, SOPs, strategies, plans, presentations, documentation, and meeting notes, daily media monitoring highlights.\n\nJanuary 2024\n\nDevelop, write and adapt press releases, statements, key messages, speeches, media lines etc. for Safer Internet Day, child protection and media monitoring. Contribute significantly to Section issue/problem analysis and solutions implementation.\n\nPress release, issue/problem analysis and solutions implementation, daily media monitoring highlights.\n\nFebruary 2024\n\nDevelop, write and adapt press releases, statements, key messages, speeches, media lines etc. for World Water Day and support media monitoring analysis and service provider communication, media monitoring\n\nPress releases, statements, key messages, speeches, op-eds, media lines, daily media monitoring highlights\n\nMarch 2024\n\nDevelop, write and adapt press releases, statements, key messages, speeches, media lines etc. for the State of the World Children Report launching, World Immunization Week and support proactive and reactive media relations, such as requests for information and interviews, media monitoring\n\nPress releases, statements, key messages, speeches, op-eds, media lines, daily media monitoring highlights.\n\nApril 2024\n\nProactively developing/pitching story ideas coordinating with international media, supporting other sections during flagship events, and media monitoring. Contribute significantly to sudden onset emergency communication, national budget campaign plans, World Day against child labour, media monitoring\n\nStories in international media, media management, press release, guidance on UNICEF branding, and daily media monitoring highlights. Sudden onset emergency communication products and coordination support, daily media monitoring highlights.\n\nMay 2024\n\nThe consultancy is deliverables based. The nature of deliverables requires the consultant to work in a very close daily collaboration with UNICEF Bangladesh Communication and Programme Section personnel\n\nMinimum Qualifications/Knowledge/Expertise/Skills Required\nMasters in Mass Communication, Journalism or related fields.\nExcellent English writing and editing skills.\nMinimum 5 years of highly relevant experience in journalism, communication, writing/editing or related.\nDetail-oriented and organized.\nAbility to work efficiently under tight deadlines.\nExperience in development is essential, with field experience would be an asset\nExperience with UNICEF or other UN experience would be an asset.\nAdministrative Details\n\nWork modality: Office based at the UNICEF Country Office in Dhaka, Bangladesh\n\nPayment: An all-inclusive lump sum monthly payment will be made upon successful completion of deliverables as per schedule, certified by the supervisor upon presentation of an invoice detailing products and services delivered in the delivery period.\n\nTravel International (if applicable): One economy class round trip travel will be paid at actual to take up duty and at the end of mission.\n\nTravel Local: 3 field visits, 1 inside Dhaka for a day and 2 outside Dhaka and each for 2 days"
  },
  {
    "job_title": "Educational Consultants",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "Teacherix",
    "job_location": "Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3597014013",
    "job_description": "Teacherix, Inc is a NY based tech platform that connects educators with international schools globally for all their hiring needs. Most graduates (Bachelor's degree) from any field find ESL (English as second language) positions and subject teaching positions through Teacherix and relocate to the country where schools are based. 90% of the time all expenses including travel, housing, medical, work permits are paid by the hiring school.\n\nThe Role\n\nYour Responsibilities Will Include\n\nYou'll contact schools (K-12) and language academy in your region and convince them to sign up on the website to post all their open positions.\nTo fulfil all of their open positions including educators and admin staff by hiring candidates from the platform\n\nIdeal Profile\n\nSkills Required\n\nYou are highly goal driven and work well in fast paced environments\nYou are a strong networker & relationship builder\nYou possess strong analytical skills and are comfortable dealing with numerical data\n\nWhat's on Offer?\n\nFlexible working options\nFantastic work culture\nAttractive Salary & Benefits"
  },
  {
    "job_title": "Country Representative",
    "job_types": "Entry level Full-time",
    "company_name": "Apex Ed - Sri Lanka Chapter",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3597011307",
    "job_description": "Apex Ed is a UK-based college offering internationally recognized programmed up to the Doctorate level. The programmed offered range from business to Education, Tourism, Hospitality, Logistic and Project Management and law while enabling students worldwide to access high-quality education.\n\nThe Role\n\nYour Responsibilities Will Include\n\nEstablishing long term goals as well as quarterly and annual business objectives and developing high quality business strategies and plans to deliver these.\nManaging the P&L and driving the business toward the achievement of business objectives.\nEnsuring that the Company's operations are consistent with its overall strategy and mission and fostering a strong organisational culture in line with the company's values.\nRepresenting the Company with clients, investors and business partners.\n\nIdeal Profile\n\nSkills Required\n\nYou have at least 1 year experience including solid experience in a similar role within Professional Services.\nYou are a seasoned leader with strong experience in managing P&Ls and driving growth within organisations.\nYou possess strong analytical skills and are comfortable dealing with numerical data\nYou are a strong mentor and coach who builds high performing teams\nYou are highly goal driven and work well in fast paced environments\n\nWhat's on Offer?\n\nStrong opportunities to progress your career\nWork alongside & learn from best in class talent\nLeadership Role"
  },
  {
    "job_title": "Executive, Corporate Sales",
    "job_types": "Entry level Full-time",
    "company_name": "Sheba.xyz",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "1 month ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3555477066",
    "job_description": "Company Description\n\nsheba.xyz is Bangladesh’s first and biggest online service marketplace with 15,000+ service providers catering to the needs of 100K+ families. We started in 2016 and gradually grew to 241+ services being offered on our platform. Be it cleaning, plumbing, electronic repair, chauffeur services, car rental, air-con, home and office shifting or at-home salon services, Sheba.xyz is connecting the growing number of urban households to professional providers at the click of a button. We provide training, certification, business management assistance, and quality assurance to keep generating demand for our service providers. We also have dedicated teams who work relentlessly to ensure high customer satisfaction, keeping this at the center of our focus.\n\nJob Description\n\nIdentify and pursue new business opportunities in the corporate sector\nBuild and maintain strong relationships with existing and prospective client\nAssist in developing and implementing a sales strategy for our corporate services\nNegotiate contracts and close deals to meet sales targets\nEnsure customer satisfaction by providing exceptional service and support\nCollaborate with internal teams to ensure customer satisfaction and successful delivery of services\n\nQualifications\n\nBachelor's degree in Business/ BBA from any reputable university\nProven track record of success in corporate sales, with a minimum of 1 to 2 years of experience\nStrong communication and negotiation skills, with the ability to build and maintain relationships\nExcellent presentation and proposal writing skills\nSelf-motivated and results-oriented, with a strong sense of accountability and ownership\nAbility to work independently and as part of a team\nKnowledge of the service sector and market trends\nProficiency in Microsoft Office\n\nAdditional Information\n\nSalary: Negotiable (depending on experience, and capabilities)\nEmployee Benefits Package comprising Sheba’s Services\nMobile Allowance\nTravel Allowance\nWeekly 2 holidays\nLunch Facilities: Subsidized\nIn our own gadget policy, we use our own laptops and get allowances based on the model\nSalary Review: Yearly\nFestival Bonus: 2"
  },
  {
    "job_title": "Bengali VRI/OPI Interpretation Vacancy",
    "job_types": "Entry level Contract",
    "company_name": "Kalam Customer Experience",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3598185101",
    "job_description": "We are hiring Bengali< >English OPI/VRI Interpreters\n\n\n\nIf you are passionate about different languages and interpretation, we need you!\n\nWe are looking for professional remote interpreters who want to join an international company and be a great help to the community.\n\nAn Over-the-Phone Interpreters (OPI) /Video Remote Interpreters (VRI) in Future Group Translation and Localization Services provide accurate communication between non-English and English speakers during the calls. They carry out exclusive service in different fields and industries and assure transparency during the conversation.\n\nInterpreters in Future Group Translation and Localization Services are linguistic experts, fast workers when it comes to the information mentioned during the call, and renowned for their high level of tolerance, accuracy, and expertise.\n\nAfter you familiarize yourself with the following description of the position, you can click \"Apply now\" and send us your resume and certificate in PDF or Word files.\n\nLocation: worldwide\n\nYour responsibilities:\nAnswer calls in a professional manner, acting according to the Interpreter's code of conduct.\nBe always prepared to take notes during a call.\nBe aware of the specific vocabulary of the industry the interpreter works with (healthcare and medical one, specifically).-You will be trained for that.\nRendering all messages accurately and completely, without adding, omitting, or substituting.\nProvide the highest level of customer service during interpreting\nFacilitate communication between Limited English Proficient and Client by rendering accurate and complete interpretation of the message. Applying standards of practice\nGo into internal professional training.\nBe eager to get new professional certifications.\nCommunicate and report to your team leader.\nComply with dress code requirements for video remote interpreting.\n\nYour background and experience:\nFluent in source language (English) and Native in target language \"Bengali\".\n1+ years of over the telephone interpretation experience in a well-known interpretation company is a plus, but not mandatory.\nGood knowledge of medical terminology is a plus, but not mandatory.\nAwareness in legal terminology is a plus.\nInternational certifications in the healthcare industry are a plus (PICSI, ALTA, HIPAA, etc.).\nHigh school diploma in your native language.\nHigh emotional intelligence and tolerance to different cultures.\nHigh level of communication, listening, note-taking, and memory retention skills.\n\nTechnical requirements:\n\nAs this position is fully remote, you should comply with several technical requirements for your computer. We need to be sure, that your home office will work effectively.\nInternet\nDedicated high-speed, private, and secured internet connection.\nMinimum download speed 10 Mbps (megabits per second)\nMinimum upload speed 3 Mbps (megabits per second)\nWired Internet, Ethernet Port (Wi-Fi is not allowed)\nSystems\nMinimum Windows 10 operating system\nComputers with dual core, 2 GHZ processor, like an Intel Core i5 or superior\n8 GB RAM memory minimum\nEquipment\nSingle device (computer or laptop) which can run required systems (see #2). (No external devices, such as cell phones or tablets, are permitted)\nExternal monitors and connectors (if applicable).\nComputers must operate in “High Performance” mode, not “balanced” or “power saver”.\nPower adapter plugged in and not operating on battery.\nChromebook, or Mac is not allowed.\nUSB Headphones Use a noise cancelling, wired headset with a built-in microphone (no wireless/Bluetooth headphones). The microphone should stay in place once adjusted. No 3.5mm adapter. Bluetooth and other wireless headsets are not allowed.\n\nWhat we offer you:\nFully remote position with a clear schedule.\nFull-time position (business and weekend hours).\nImmediate availability to start working after onboarding.\nInternal Certified training.\nMonthly fee payments.\nContract type of employment.\n\nIf you choose to work with Future Group Translation and Localization Services you will get into a friendly team, that supports each other, actively communicates, has its own corporate culture, and achieves the goals together!\n\nAbout us:\n\nFounded in 1994, Future Group has grown into one of the world’s most trusted translation and localization expert houses\n\nacross the globe.\n\nWe have successfully established a global reputation for meeting our clients’ requirements in the most beneficial and\n\ncost-effective way.\n\nWith a high-tech translation memory software technology, ISO certification and access to translators for any language\n\nand business application, Future Group has earned a reputable image all across the language services market.\n\nSend us your resume. If your expertise complies with the requirements listed above, our Talent Acquisition Team will contact you by email to explain in detail the pay rates, schedules, and other working conditions.\n\nWe will be happy to welcome you to our team!"
  },
  {
    "job_title": "Media Lead",
    "job_types": "Mid-Senior level Full-time",
    "company_name": "10 Minute School",
    "job_location": "Dhaka, Dhaka, Bangladesh",
    "job_date": "3 weeks ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3599775547",
    "job_description": "Company Description\n\n10 Minute School is the pioneer of the Ed-Tech industry in Bangladesh. We are teaching more than 2 million students every day through our website, app, and social media to accelerate their learning.\n\nWe are a Sequoia Capital-backed Education Technology Organization in Bangladesh. Our goal is to ensure access to quality education for everyone in Bangladesh through a wide range of free-tier and premium content for Academic, Skill Development, and Jobs segments.\n\nJob Description\n\nJob Modality: Permanent Job\n\nLocation: Mohakhali DOHS\n\nSalary: As per company policy\n\nAs the Media Lead at 10 Minute School, you will be responsible for leading the in-house creative content team, including copywriting, video production, post-production, and design. You will collaborate with the content, marketing, and product teams to ideate, execute, and deliver high-quality video and static content that aligns with the 10MS brand and target audience.\n\nJob Responsibilities:\n\nCreate top-level creative direction and guidelines based on strategic briefs\nLead and align the copywriting, production, post-production, and design teams in all stages of content production\nFacilitate creative brainstorming sessions to generate ideas with the copywriting team\nEnsure that the creative outlook of content aligns with the 10MS brand and specified target audience\nDevelop promotional content to meet marketing strategies and objectives\nWork with the marketing team to execute short and long-term brand-building campaigns\nAct as a liaison between the strategy development and creative production wings based on project needs\nWork with other departments to facilitate strategic growth of 10 Minute School's creative wing in terms of speed and scale\nQualifications\n\n6+ years of industry experience, with at least 3 years in digital creative agencies or independent content production companies as a creative director or functionally similar role\nStrong project management skills, with the ability to manage creative projects from conception to delivery\nExperience in developing content for digital platforms and ability to adapt content for short-form platforms\nIn-depth understanding of the technicalities of video production\nUnderstanding of copywriting and basic screenplay writing\nUnderstanding of digital products and content befitting digital distribution platforms\nUnderstanding of branding and marketing principles, with the ability to apply them in a creative context\nAbility to pitch ideas to different teams to help them visualize a final creative outlook\nAbility to maintain a balance between quality and speed of output in multiple ongoing projects\nAbility to communicate with multiple teams in both creative and non-creative wings\nAbility to coordinate with external stakeholders and B2B clients\nStay up-to-date on industry trends, competitors, and best practices to continually improve creative content production\nProficient in digital collaboration tools like Google Suite, Notion, etc.\nStrong communication, proactive, organizational skills, a digital business-driven mindset, and a team player mentality\n\nAdditional Information\n\nWe are the fastest growing EdTech of Bangladesh. We believe in promoting a workplace where everyone has the opportunity to grow, create and excel.\n\nEmployee Centric Policies\n\nMaternity Leave | Paternity Leave | PTO\n\nLearning Opportunities\n\nCompetitive Compensation | Fast-tracked growth | Quarterly Reviews and Feedback | Personalized Development Plan\n\nHealth and Wellness\n\nOpen Pantry | Game nights | Quarterly Events\n\nJoin us to transform education together. APPLY NOW!"
  },
  {
    "job_title": "Territory Officer",
    "job_types": "Entry level Full-time",
    "company_name": "BAT",
    "job_location": "Bangladesh",
    "job_date": "4 weeks ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3529670579",
    "job_description": "BAT is evolving at pace - truly like no other organisation.\n\nTo achieve the ambition, we have set for ourselves, we are looking for colleagues who are ready to live our ethos every day. Come be a part of this journey!\n\nBAT BANGLADESH IS LOOKING FOR A TERRITORY OFFICER\n\nSENIORITY LEVEL Entry Level\n\nFUNCTION Marketing\n\nSALARY RANGE Competitive Salary + excellent benefits + market leading bonus\n\nLOCATION Flexible Location\n\nROLE POSITIONING AND OBJECTIVES\n\nThe role is responsible for engaging with customers and driving our business strategies. It is a part of our National Trade Team. Our Territory Officers are the face of BAT Bangladesh and the talent pipeline to the business, equipped with specialist product and brand knowledge, you’ll be out on the road visiting customers in your ‘patch’ for the bulk of your day, using your commercial eye for business and planning capability, while having an upbeat drive for results and passion for success.\n\nReports to Area Manager\n\nReporting Level Mid-Senior Level\n\nGeographic Scope Bangladesh\n\nWhat You Will Be Accountable For\nAnalysing, reporting and interpreting store specific data in order drive growth\nActing as the point of reference for external partners by engaging in commercial conversations and negotiations;\nBuilding, encouraging and maintaining strong business partnerships with retailers;\nResponsibly educating retailers on product and category knowledge as well as on trading terms;\nEnsuring execution of strategies and campaigns for all retailers are achieved within your patch;\nMeeting, and exceeding, performance targets;\nContinually developing your skills to adapt to the changing industry and regulatory environment.\nCAN THIS BE YOUR FUTURE ROLE?\nDo you seek to tackle stretch challenges and deliver within deadlines?\nAre you flexible to dive into our world full of diversity and inclusion?\nEssential Experience, Skills And Knowledge\nThe job requires a sound educational background with minimum Bachelors degree (preferably business graduates)\nPrior experience in sales / marketing (experience as a trade representative in an FMCG environment is an added bonus);\nA customer focused approach & solutions driven mentality;\nStrong selling, negotiation and objective handling skills;\nThe aim to be Empowered, work independently and focus on results;\nA proven track record to build close working relationships with a diverse range of partners;\nExcellent planning and prioritisation skills;\nA desire to be Bold and Fast, while acting Responsibly, as you grow and develop your career\nBENEFICIAL\nHands-on experience in sales and meeting sales targets.\nWE ARE BAT\n\nAt BAT we are committed to our Purpose of creating A Better Tomorrow. This is what drives our people and our passion for innovation. See what is possible for you at BAT.\nGlobal Top Employer with 53,000 BAT people across more than 180 markets\nBrands sold in over 200 markets, made in 44 factories in 42 countries\nNewly established Tech Hubs building world-class capabilities for innovation in 4 strategic locations\nDiversity leader in the Financial Times and International Women’s Day Best Practice winner\nSeal Award winner – one of 50 most sustainable companies\nBELONGING, ACHIEVING, TOGETHER\n\nCollaboration, diversity and teamwork underpin everything we do here at BAT. We know that collaborating with colleagues from different backgrounds is what makes us stronger and best prepared to meet our business goals. Come bring your difference!"
  },
  {
    "job_title": "IT Recruiter",
    "job_types": "Entry level Full-time",
    "company_name": "AppCake",
    "job_location": "Bangladesh",
    "job_date": "5 days ago",
    "apply_link": "https://www.linkedin.com/jobs/search?location=Dhaka%2C%20Dhaka%2C%20Bangladesh&geoId=103561184&trk=public_jobs_jobs-search-bar_search-submit&position=23&pageNum=0&currentJobId=3597005957",
    "job_description": "AppCake is an innovative product company that has specialized in successful mobile app development since 2017. We conquer the IT industry with a non-trivial approach, interesting tasks and the active use of modern technologies. The released products are distinguished by positive download growth, intuitive interface and easy perception by end users. Our goal is to create quality products that are understandable and easy to use. Our customers are millions of users of applications based on Android and iOS.\n\nWorking in AppCake is a creative process in a team of professionals. The company provides an opportunity for each employee to build a successful career by implementing bold ideas and using their full potential\n\nThe Role\n\nYour Responsibilities Will Include\n\nLiaise with clients to understand role requirements in order to source the most suitable candidates\nWrite and post technical job descriptions on specialist IT job boards, social media and any other relevant channels\nSource, screen and compile a shortlist of qualified candidates for various technical roles\nInterview candidates combining various methods (e.g. structured interviews, technical assessments and behavioral questions)\nBuild a candidate CRM to ensure a solid pipeline of qualified candidates - ensuring candidate data is kept updated\nParticipate in tech conferences and meetups to network with IT professionals\nKeep up to date with new technological trends in order to form strategic conversations with clients on future hiring needs\n\nIdeal Profile\n\nSkills Required\n\nExperience in a similar position from 6 months.\nKnowledge of various search systems, the ability to use them.\nCompetent written and oral speech.\nExperience in closing IT vacancies.\nOrganization; Responsibility, Punctuality.\nHigh communication skills.\nBasic knowledge of the difference in IT technologies and programming languages (Java, Kotlin, Swift, C#) will be a plus\n\nWhat's on Offer?\n\nGreat Opportunity"
  }
]
